// 1)მოიძიეთ დეტალური ინფორმაცია და ახსენით რა არის მოდული და რაში არის საჭირო,როდის ვიყენებთ
// მოდული არის კოდის ცალკე ფაილი, რომელიც აკეთებს ერთ კონკრეტულ საქმეს და რომლის ნაწილებიც შეგიძლია გაუზიარო სხვა ფაილებს. მოდული გვჭირდება საიტის ფაილების ორგანიზაციისთვის


// დავალება 3: "მათემატიკური დამხმარე"შექმენი კლასი MathHelper, რომელსაც ექნება შემდეგი სტატიკური მეთოდები:
// 1)isEven(number): აბრუნებს true-ს თუ რიცხვი ლუწია, სხვა შემთხვევაში — false.
// 2)average(numbers): იღებს რიცხვების მასივს და აბრუნებს მათ საშუალო არითმეტიკულს.
// მოთხოვნა: კოდში არ გამოიყენო new MathHelper(). მეთოდებს მიმართე პირდაპირ კლასიდან.


let jami = 0

class MathHelper{




    static isEven = number => {
        return number % 2 === 0

    }



    static average = numbers => {

        for(let i of numbers) {
            jami += i
            
        }
        return jami / numbers.length

    }



}


console.log(MathHelper.isEven(20));
console.log(MathHelper.average([10, 20, 30, 40, 50, 60]));






// დავალება 4: "კალკულატორის მოდული"
// შექმენი ორი ფაილი:

// ფაილი 1: calculator.js

// შექმენი და დააექსპორტე (named export) მარტივი ფუნქციები: add(a, b) და subtract(a, b).

// შექმენი და დააექსპორტე (default export) კლასი Calculator, რომელსაც ექნება მეთოდი multiply(a, b).

// ფაილი 2: main.js

// დააიმპორტე ფუნქციები და კლასი calculator.js-დან.

// გამოიყენე ყველა ფუნქცია და დაბეჭდე შედეგები კონსოლში.



// ----------------------------------------
// 3. კომბინირებული დავალება: "ავტომობილების მენეჯერი"
// ეს დავალება აერთიანებს ორივე თემას და გვეხმარება ლოგიკურ დაყოფაში.

// ნაბიჯი 1: მოდულის შექმნა (Car.js)
// შექმენი კლასი Car, რომელსაც აქვს:

// კონსტრუქტორი: brand და model.

// სტატიკური მეთოდი compare(car1, car2): ეს მეთოდი უნდა იღებდეს ორ მანქანას და აბრუნებდეს ტექსტს: "ეს მანქანები ერთი ბრენდისაა", თუ მათი brand ერთნაირია.

// დააექსპორტე ეს კლასი.

// ნაბიჯი 2: გამოყენება (app.js)
// დააიმპორტე Car კლასი.

// შექმენი ორი მანქანის ობიექტი (მაგალითად: Toyota Camry და Toyota Corolla).

// გამოიყენე სტატიკური მეთოდი Car.compare() მათ შესადარებლად.