# ოჯახის წევრების ასაკების შეყვანა
mother_age = int(input("შეიყვანეთ დედის ასაკი: "))
father_age = int(input("შეიყვანეთ მამის ასაკი: "))
sister_age = int(input("შეიყვანეთ დის ასაკი: "))

# 25 წლის შემდეგი ასაკების გამოთვლა
print("დედა 25 წლის შემდეგ იქნება:", mother_age + 25)
print("მამა 25 წლის შემდეგ იქნება:", father_age + 25)
print("და 25 წლის შემდეგ იქნება:", sister_age + 25)


# მომხმარებლის სახელის შეყვანა
name = input("შეიყვანეთ თქვენი სახელი: ")

# მონაცემის ტიპის შემოწმება
print(type(name))



# ასაკის შეყვანა
age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# ასაკის გადაქცევა სტრინგად
age_str = str(age)

print(age_str)
print(type(age_str))



# str() ფუნქცია:
# ნებისმიერ მნიშვნელობას აქცევს ტექსტურ მონაცემად (string)

# int() ფუნქცია:
# ტექსტს ან ათწილად რიცხვს აქცევს მთელ რიცხვად

# float() ფუნქცია:
# ტექსტს ან მთელ რიცხვს აქცევს ათწილად რიცხვად
