# 2) შექმენი ცვლადი რომელსაც დაარქმევთ name-ს და მნიშვნელობად გადაეცით თქვენი სახელი, შექმენი მეორე ცვლადი რომელსაც დაარქმევთ LastName-ს და მნიშვნელობად გადაეცით თქვენი გვარი და საბოლოოდ დაპრინტეთ ცალ-ცალკე.
name = 'Tsotne'
lName = 'ivanashvili'

print(name, lName)

# 3) შექმენი ოთხი ცვლადი პირველ ცვლადს გადაეცით ინტეჯერი, მეორეს სტრინგი, მესამეს ფლოუთი, მეოთხეს ბულეანი და საბოლოოდ დაპრინტეთ ცალ-ცალკე
str = 'Tsotne'
num = 17
bool = True
float = 1.73

print(str)
print(num)
print(bool)
print(float)

# 4) შექმენით იმდენი ცვლადი რამდენი ოჯახის წევრიც გყავთ. თითოეულს მნიშვნელობად მიანიჭეთ თქვენი ოჯახის წევრების ასაკი და საბოლოოდ შეკრიბეთ თითოეული ოჯახის წევრის ასაკი.
tsotne = 17
maka = 50
dato = 50
nini = 19
print(tsotne + maka + dato + nini)
