text = "Python"
print(text[0:4])  # გამოიტანს "Pyth" (ასოები 0,1,2,3)
print(text[2:])   # გამოიტანს "thon" (2–დან ბოლომდე)
print(text[:3])   # გამოიტანს "Pyt" (0–დან 3–ამდე)
print(text[::2])  # გამოიტანს "Pto" (ყველა მეორე ასო)


# Slicing არის სიის, სტრიქონის ან ნებისმიერ Iterable-ის ნაწილის ამოღების მეთოდი
# სინტაქსი: sequence[start:end:step]
# start – საიდან იწყება
# end – სად მთავრდება (end თავად არ შედის)
# step – ნაბიჯი (სად გადავდივართ თითოეულ სტეპზე)
# გამოიყენება იმისთვის, რომ ამოვიღოთ ნაწილები სიისგან, სტრინგისგან ან tuple–ისგან

family = ["მარიამ", "გიორგი", "ნინო", "ლაშა", "თამარი"]

# დაბეჭდვა პირველი სამი ელემენტი
print(family[:3])  # ["მარიამ", "გიორგი", "ნინო"]

mixed_list = [10, "Tsotne", 3.14, True, "Python", 42, "Hello", False]

# დაბეჭდვა ბოლო 5 ელემენტი
print(mixed_list[-5:])  # [True, "Python", 42, "Hello", False]



my_name = "Tsotne"

# დაბეჭდვა ბოლო სამი ასო
print(my_name[-3:])  # "tne"


favorite_car = input("შეიყვანეთ თქვენი საყვარელი მანქანის სახელი: ")

# დაბეჭდვა პირველი სამი ასო
print(favorite_car[:3])








