# Sequencing — პროგრამის ნაბიჯ-ნაბიჯ შესრულება, ანუ ბრძანებების რიგითობა
# მაგალითი:
# პროგრამა: შეიყვანე სახელი → დაბეჭდე სახელი
name = input("შეიყვანეთ სახელი: ")
print(name)

# Iteration — ლუპის გამოყენება, პროგრამის ნაწილის გაკეთება რამდენჯერმე
# მაგალითი:
# დაბეჭდე რიცხვები 1-5
for i in range(1, 6):
    print(i)

# Selection — პირობის შემოწმება (if/else) და სხვადასხვა საქმის შესრულება პირობის მიხედვით
# მაგალითი:
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age >= 18:
    print("შეგიძლიათ ხართ სრულწლოვანი")
else:
    print("უფროსი უნდა იყოთ სრულწლოვანისთვის")




# საიტერაციო ცვლადი არის ცვლადი, რომელიც ციკლში გამოიყენება
# თითოეული იტერაციისთვის იცვლება (მაგალითად i ციკლში)
# მაგალითი:
for i in range(5):  # i არის საიტერაციო ცვლადი
    print(i)  # i ცვლის მნიშვნელობას 0,1,2,3,4





for i in range(1, 21, 2):  # სტეპი 2, ამიტომ მხოლოდ კენტი რიცხვები
    print(i)





for i in range(0, 51, 2):  # სტეპი 2, იწყება 0-დან → ლუწი რიცხვები
    print(i)





for i in range(15):
    print("Giorgi")  # ან შეცვალე შენი სახელი
