# 2)შექმენით 5 ელემენტიანი Tuple და unpacking ის გამოყენებით თითოეულ ელემენტს მიანიჭეთ შესაბამისი ცვლადი
names = ("Tsotne", "Nika", "Lika", "Tika", "Nino")
name1,name2,name3,name4,name5 = names
print(name1, name2, name3, name4, name5)

# 3)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება ის list ისგან
# tuple არის ელემენტების კოლექცია ის ლისტისგან განსხვავდება მხოლოდ იმით რომ მის შიგნით მყოფი ელემენტების ამოღება ჩამატება ან შეცვლა არ არის შესაძლებელი

# 4)შექმენით 6 ელემენტიანი tuple და გამოიყენეთ .index() და .count() მეთოდები
names = ("Tsotne", "Nika", "Lika", "Tika", "Nino")


# 5) კომენტარებით ახსენით რა არის *rest
# *rest აღნიშნავს tuple-ს unpacking-ის დროს კონკრეტული ელემენტის შემდეგ ყველა ელემენტს