# ცვლადი, რომელიც რიცხვებს გამოისახავს
i = 1

while i <= 10:  # სანამ i <= 10, ციკლი ჩაირთვება
    print(i)
    i += 1  # i-ს 1-ს ვამატებთ თითოეულ იტერაციაზე


# ცვლადი საწყისი მნიშვნელობით 10
i = 10

while i >= 1:  # სანამ i >= 1, ციკლი გაგრძელდება
    print(i)
    i -= 1  # თითოეულ იტერაციაზე 1-ით ვამცირებთ i-ს


# სწორი სახელი
correct_name = "Tsotne"

# ციკლი დაიწყება
while True:
    user_name = input("შეიყვანეთ თქვენი სახელი: ")
    
    if user_name == correct_name:
        print("პასუხი სწორია!")
        break  # ციკლი შეწყდება
    else:
        print("სწორი სახელი არ შეიყვანეთ, სცადეთ თავიდან.")
