# len() ფუნქცია აბრუნებს სიის, სტრინგის ან სხვა კოლექციის ელემენტების რაოდენობას

my_list = [10, 20, 30, 40]
print(len(my_list))  # დაბეჭდავს 4

# 1. append() - ემატება ელემენტი სიას ბოლოს
numbers = [1, 2, 3]
numbers.append(4)
print(numbers)  # [1, 2, 3, 4]

# 2. insert() - ემატება ელემენტი კონკრეტულ ინდექსზე
numbers.insert(1, 10)  # 1-ლი ინდექსზე დაამატებს 10
print(numbers)  # [1, 10, 2, 3, 4]

# 3. pop() - ამოწმდება/შეიხსნება ელემენტი კონკრეტული ინდექსიდან (ან ბოლოს)
numbers.pop(2)  # წაშლის 2-ე ინდექსზე მდგომ ელემენტს
print(numbers)  # [1, 10, 3, 4]


my_list = [10, "Hello", 3.14, True]
my_list.append("ივანაშვილი")  # დასასრულს ვუმატებთ სახელს
print(my_list)


family = ["მამა", "დედა", "ძმა", "სიძე"]
family[2] = "კატა"  # 2-ე ინდექსზე ვდებ საყვარელ ცხოველს
print(family)


numbers = list(range(1, 11))  # [1,2,3,4,5,6,7,8,9,10]
numbers.pop(4)  # წაშლის 4-ე ინდექსზე მდგომ ელემენტს (5)
print(numbers)
