# მომხმარებელს სთხოვს შეიყვანოს რიცხვი 1-დან 20-მდე
num = int(input("შეიყვანეთ რიცხვი 1-დან 20-მდე: "))

# შემოწმება
if num < 10 or num > 20:
    print("good")  # თუ რიცხვი ნაკლებია 10-ზე ან მეტია 20-ზე
else:
    print("bad")   # სხვა შემთხვევაში




# if — თუ მოცემული პირობა მართალია, მაშინ შესრულდება შემდეგი კოდი
# elif — "else if", დამატებითი პირობის შემოწმება, თუ if არ შესრულდა
# else — თუ ყველა წინარე პირობა არ შესრულდა, ეს ნაწილი აუცილებლად შესრულდება




age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if age >= 18:  # თუ ასაკი მეტია ან ტოლია 18-ს
    print("სრულწლოვანი")
else:          # თუ ასაკი ნაკლებია 18-ზე
    print(" არასრულწლოვანი")




num = int(input("შეიყვანეთ ნებისმიერი რიცხვი: "))

if num % 2 == 0:   # თუ რიცხვი იყოფა 2-ზე და ნაშთი 0–ია
    print("Even")
else:              # სხვა შემთხვევაში
    print("Odd")




score = int(input("შეიყვანეთ ქულა 1-დან 10-მდე: "))

if score >= 8:  # თუ ქულა მეტია ან ტოლია 8-ზე
    print("თქვენ წარმატებით ჩააბარეთ გამოცდა")
else:           # თუ ქულა ნაკლებია 8-ზე
    print("თქვენ ჩაიჭერით")
