
# 1)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება სიისგან

# tuple არის ელემენტების კოლექცია ლისტისგან განსხვავდება მხოლოდ იმით რომ მის შიგნით მყოფი ელემენტების ამოღება ჩამატება ან შეცვლა არ შეიძლება


# 2)შექმენი Tuple სადაც გექნება შენახული ადამიანის სახელები, შემდეგ გამოიტანე პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი, სცადე slicing ის გამოყენება
names = ("Tsotne", "Nika", "Giorgi", "Nini")
name1, name2, name3, name4 = names
print(name1, name4)

# 3) კომენტარებით ახსენით tuple ს თითოეული მეთოდი რაომელი რას აკეთებს
# count() - აბრუნებს თუ რამდენჯერ გვხვდება ერთ და იგივე ელემენტი მის შიგნით
# index() - აბრუნებს მითითებული ელემენტის ინდექსს

# 4) კომენტარებით ახსენით დეტალურად ყველაფერი რასაც დაწერთ (კოდი ახსენით)
# მეორე დავალებაში შევქმენი tuple სახელად names, შემდეგ შევინახე მასში სახელები შემდეგ unpacking-ის საშუალებით თითოეულ ელემენტს მივანიჭე თავიანთ სახელი და ბოლოს გამოვპრინტე პირველი და ბოლო ელემენტი tuple-დან


# 5)კომენტარებით ახსენით რა არის unpacking და მოიყვანეთ unpacking ზე 5 მაგალითი 
# unpacking არის კოლექციის დაშლა რაც საშუალებას გვაძლევს მის ელემენტებს მივანიჭოთ ცვლადები

fruits = ("Mango", "Blueberry", "Melon")
fruit1, fruit2, fruit3 = fruits
print(fruit1, fruit2, fruit3)

numbers = [1, 2, 3, 13, 5, 6, 1, 151, 314, 61]
first, *rest = numbers
print(first, rest)  

