// 1) მოიძიეთ ინფორმაცია event loop ზე და ახსენით კომენტარებით , ახსენით რა არის call stack და callback queue

// event loop
// event loop-ი არის გზა ასინქრონული ოპერაციების დასამუშავებლად მიუხედავად იმისა რომ JS არის single threaded.


// call stack არის სტრუქტურა, სადაც ინახება მიმდინარე ფუნქციების გამოძახებები.
// როცა ფუნქცია იძახება ის ემატება stack-ში.
// როცა ფუნქცია ასრულებს მუშაობას ის შორდება stack-ს.
// თუ stack გადაივსო მივიღებთ stack overflow-ს.


// Callback Queue არის რიგი სადაც ხვდება ასინქრონული ოპერაციების callback-ები
// მაგალითად: setTimeout, DOM events, fetch და სხვა
// როცა მათი შესრულების დრო დგება ისინი stack-ში არ შედიან პირდაპირ




// 2)მოიძიეთ ინფორმაცია რა არის API და დეტალურად ახსენით
// Application Programming Interface არის ინტერფეისი რომელიც საშუალებას აძლევს ერთ პროგრამას დაუკავშირდეს მეორეს მაგალითად front-end დაუკავშირდეს back-end-ს


// 3)სახელის დაბრუნება:
// დაწერე async ფუნქცია getUserName(), რომელიც უბრალოდ აბრუნებს სტრინგს "გიორგი". 
// გამოიძახე ეს ფუნქცია და მიღებული შედეგი (Promise) დაბეჭდე .then()-ის საშუალებით.

async function getUserName(name){
    return name
    
}

getUserName("გიორგი").then(user => console.log(user))


// 4)მოიძიეთ ინფორმაცია try და catch ზე, მეც ვისაუბრებ ამაზე დეტალურად მაგრამ მაინც



// 5)await-ით ლოდინი
// დაწერე კოდი, რომელიც სიმულაციას გაუკეთებს მონაცემების წამოღებას:

// შექმენი ფუნქცია getData, რომელიც აბრუნებს Promise-ს. ეს Promise უნდა სრულდებოდეს 2 წამის შემდეგ და აბრუნებდეს რიცხვს 100.

// შექმენი მეორე ფუნქცია processData, რომელიც იქნება async.

// processData-ს შიგნით გამოიყენე await, რომ დაელოდო getData-ს შედეგს, გაამრავლო ის 2-ზე და დაბეჭდო კონსოლში.