# 1)ახსენით კომენტარებით რომელი მონაცემთა ტიპები გვაქვს და განმარტეთ თითოეული
# int — მთელი რიცხვები (მაგ: 1, 5, 100)
number = 10

# float — ათწილადი რიცხვები (მაგ: 1.5, 3.14)
price = 9.99

# str — ტექსტური მონაცემები (წერილები, სიტყვები)
name = "Giorgi"

# bool — ლოგიკური მონაცემი (True ან False)
is_active = True

# 2)შექმენით ცვლადი და გაანახლეთ მნიშვნელობა სამჯერ და შემდეგ გამოიტანეთ შედეგი ტერმინალში
age = 10      # საწყისი მნიშვნელობა
age = 15      # პირველი განახლება
age = 20      # მეორე განახლება
age = 25      # მესამე განახლება

print(age)    # საბოლოო შედეგის გამოტანა

# 3)შექმენით ორი ცვლადი სადაც გექნებათ რიცხვები შენახული, მესამე ცვლადში შეინახეთ ამ ორი ცვლადის მნიშვნელობების ჯამის შედეგი და ბოლოს გამოიტანეთ შედეგი გამოიტანეთ ეკრანზე

a = 7
b = 13

sum = a + b   # ორი ცვლადის ჯამის შენახვა მესამე ცვლადში
print(sum)    # შედეგის გამოტანა ეკრანზე
