# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

num = [12, 31, 0, 10, 15, 21, 25]
newNum = [i for i in num if i % 5 == 0 if i % 3 == 0]
print(newNum)

# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში ჩაამატეთ ისეთი სახელები სახელები რომლის სიმბოლოების რაოდენობაც არის ლუწი რიცხვი
names = ["Tsotne", "Nika", "Gio", "Lasha", "Toko"]
newNames = [i for i in names if len(i) % 2 == 0]
print(newNames)

# 3) ახსენით კომენტარებით რაში გვჭირდება list comprehension

#ის გამოიყენება დიდი კოდის ერთ ხაზში დასაწერად 