# მომხმარებლის ასაკის შეყვანა
age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# ვიგებთ რამდენჯერ მოთავსდება 10 ასაკში
result = age // 10

print("რიცხვი 10 თქვენს ასაკში მოთავსდება:", result, "ჯერ")


# ჩემი სახელი
my_name = "Tsotne"

# მომხმარებლის სახელის შეყვანა
user_name = input("შეიყვანეთ თქვენი სახელი: ")

# შედარება
print(user_name == my_name)


# ორი რიცხვის შეყვანა
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# ნაშთის პოვნა
remainder = num1 % num2

print("ნაშთი არის:", remainder)




# ასაკის შეყვანა
age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# ლუწობის შემოწმება (ნაშთი უნდა იყოს 0)
print(age % 2 == 0)
