// 1) რა არის javascript და რისთვის გამოიყენება?
// javascript არის პროგრამირების ენა რომელიც ძირითადად გამოიყენება ვებსაიტებზე ინტერაქციულობის დამატებას

// 2) რა არის console.log()?
// console.log() არის ფუნქცია რომელშიც გადაცემული მნიშვნელობა გამოაქვს კონსოლში


// 3) რა განსვავებაა let-სა და const-ით შექმნილ ცვლადებს შორის, მოიყვანეთ მაგალითი.
// let ით შექმნილი ცვლადის მნიშვნელობა შეცვლადია ხოლო const-ით შექქმნილი ცვლადი უცვლადია

// 4) ჩამოწერეთ ჯავასკრიპტის მონაცემთა ტიპები და ახსენით კომენტარის სახით.
// string - ნებისმიერი რამ რაც ""-ში არის მოქცეული
// Number - არის ნებისმიერი რიცხვი მთელიც და ათწილადიც
// boolean - არის ლოგიკური მნიშვნელობა true/false
// null - ასახავს ჩვენი ხელით მითითებულ ცარიელ მნიშვნელობას
// undefined - როდესაც შექმნილია მაგრამ მნიშვნელობა არაქვს


// 5) console.log() ის საშუალებით კონსოლში გამოიტანეთ 3-3 მაგალითი მათემატიკურ ოპერატორებზე.
// console.log(3 * 5);
// console.log(3 / 5);
// console.log(3 + 5);
// console.log(3 - 5);
// console.log(10 % 2);
// console.log(2 ** 3);





// 6) კომენტარის სახით ახსენით დღევანდელ გაკვეთილზე ნასწავლი სტრინგის მეთოდები და მოიყვანეთ თითო-თითო მაგალითი:
// .charAt() - მას გადაეცემა ინდექსი და გამოაქვს ის ასო რომელ ინდექსაც ჩვენ გადავცემთ
// .concat() - აერთიანებს სტრინგებს
// .slice() - ჭრის სტრინგს
// .toUpperCase() - აქცევს სტრინგის ყველა ასოს დიდ ასოდ
// .toLowerCase() - აქცევს სტრინგის ყველა ასოს პატარა ასოდ
// .trim() - აშორებს სფეისებს დასაწყისში და ბოლოში
// .trimStart() - აშორებს სფეისებს დასაწყისში
// .trimEnd() - აშორებს სფეისებს დასასრულში
// .repeat() - იმეორებს სტრინგს
// .replace() - ცვლის პირველ ნაპოვნ მნიშვნელობას
// .replaceAll() - ცვლის ყველა ნაპოვნ იგივე მნიშვნელობას
// .split() - ყოფს სტრინგს მასივად
// .startsWith() - ამოწმებს იწყება თუუ არა მოცემული მნიშვნელობით
// .endsWith() - ამოცმებს მთავრდება თუ არა მოცემული მნიშვნელობით



const greet = " "
const msg = document.getElementById("Haa")

if(greet === ""){
    msg.textContent += "Guest"
    
}
else{
    msg.textContent += greet
    
}


