#logical operators:
# and - აბრუნებს True იმ შემთხვევაში თუ ორივე პირობა ჭეშმარიტია
x = 10

if x > 5 and x < 20:
    print("შუალედშია")


# or - აბრუნებს True თუ მინიმუმ ერთი პირობა მაინც ჭეშმარიტია.
age = 17

if age < 18 or age > 65:
    print("ფასდაკლება გაქვს")


# not - აბრუნებს საპირისპიროს
loggedIn = False

if not loggedIn:
    print("გთხოვთ, გაიარეთ ავტორიზაცია")


# შედარების ლოგიკა (if else)
# if else ადარებს ერთმანეთს ორ ელემენტს და საბოლოოდ აბრუნებს ან True ან False
score = 85

if score >= 50:
    print("passed")
elif score >= 90:
    print("excellent")


#ლუპები
# for ლუპს გამოვიყენებთ რაღაც მოქმედების მრავალჯერ შესრულების მიზნით და მას მხოლოდ ვიყენებთ იმ შემთხვევაში თ ვიცით საიდან სადამდე რამდენჯერ გვინდა რომ გამეორდეს ეს კოდი
numbers = [1, 2, 3]

for n in numbers:
    print(n)

#While ლუპი აკეთებს იგივეს უბრალოდ გამოვიყენებთ იმ შემთხვევაში თუ არ ვიცით საიდან სადამდე უნდა გამეორდეს მასში არსებული ლოგიკა

#სიები

#List - არის ელემენტების კოლექცია და ის შეიძლება როგორც შევცვალოთ ასევე მასში არსებული ელემენტები წავშალოთ და შევცვალოთ

fruits = ["apple", "pear"]

#tuple - არის ელემენტების კოლექცია და ლისტისგან განსხვავებით მასში არსებული ელემენტების შეცვა არ შეგვიძლია

names = ("Tsotne", "Nika")

#Set - არის ელემენტების კოლექცია რომელსაც არ აქვს ინდექსები და ყოველი კოდის გაშვებაზე ეცვლება ელემენტებს ადგილები
nums = {1, 32, 41}
