// 1) შექმენი სია სადაც შეინახავთ რიცხვებს 1 დან 10-ის ჩათვლით მაპის საშუალებით თითუელი ელემენტი გაამრავლეთ 7-ზე.

let nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

nums.map( (i) => {console.log(i * 7);
})

// 2) შემენი სია სადაც შეინახავთ სპორტის სხვადასხვა სახეობებს, For Each-ის საშუალებით გამოიტანეთ თითოეული ელემენეტი ცალ-ცალკე და გვერძე ქონდეს მისი ინდექსი.

let sports = ["Football", "Basketball", "Volleyball", "Rugby"]

sports.forEach( (i, index) => {
    console.log(`${i} - ${index}`);
})


// 3) შემქენი სია სადაც გექნება 20 ნებისმიერი რიცხვი filter-ის საშულებით დატოვეთ მხოლოდ ის რიცხვები რომლის ინდექსიც არის ლუწი.

let numbers = [1, 3, 4, 5, 6, 7, 8,8, 8, 8, 6,5 ,52, 13, 5, 11, 51, 513, 51,]

numbers.filter( (i, index) => {
    index % 2 == 0
})


// 4) კომენტარის სახით ახსენით რა არის reduce.
// reduce არის მეთოდი რომელიც ყველა ელემენტს გადაუვლის და მათ შეკრებს ერთ მნიშვნელობაში

// 5) კომენტარის სახით ახსენით რა არის accumulator.
// accumulator არის reduce მეთოდში ცვლადი რომელიც აგროვებს

// 6) შემქენი სია სადაც გექნებათ 5-ი ნებისმიერი რიცხვი reduce-ის საშუალებით დააჯამე თითოეული რიცხვი ერთმანეთს.

let arr = [100, 19, 108, 324, 560]

let jami = arr.reduce( (accumulator, current) => {
    accumulator + current
},101)

console.log(arr);


// 7)წარმოიდგინე, გაქვს მაღაზიის პროდუქტების სია და გინდა ისინი კატეგორიების მიხედვით დააჯგუფო.
// აქ accumulator აღარ იქნება უბრალო რიცხვი, ის იქნება ობიექტი {}, რომელიც ნელ-ნელა შეივსება. 

