// 1) კომენტარის სახით ახსენით რა არის Higher Order Function და Callback Function

// callback function - არის ფუნქცია რომელსაც სხვა ფუნქციას არგუმენტად გადავცემთ
// higher order function - არის ფუნქცია რომელიც იღებს სხვა ფუნქციას არგუმენტად

// შექმენი ფუნქცია, რომელიც იღებს რიცხვების მასივს და ქოლბექ ფუნქციას, ამუშავებს თითოეულ ელემენტს ქოლბექით და ბოლოს აბრუნებს მიღებული შედეგების საშუალო მნიშვნელობას.



// მოიძიეთ ამ ფუნქციებზე ინფორმაცია .forEach(), .map(), .filter() და თითოზე გააკეთეთ ორ ორი მაგალითი, ასევე ახსენით რას აკეთებს და რაში გვჭირდება
// .foreach() - ფუნქცია გამოიყენება მასივში თითოეულ ელემენტზე მისაწვდომად იგივეა რაც for loop ით რომ გადავუაროთ ლისტს პითონში
let nums = [1, 2, 3, 4, 5, 6, 7]

nums.forEach( (i) => { console.log(i);
})

// .map() - ფუნქცია იძახებს მასში გადაცემულ ფუნქციას თითოეული ელემენტისთვის რომელიც მასივშია და ქმნის ახალ მასივს შედეგით

let nums2 = [4, 5, 6, 7, 8, 53, 1,5 ,31, 53,]

nums2.map((i) => {console.log(i**2);
})

// .filter() - ფუნქცია ქმნის ახალ მასივს რომელიც გაივლის მასში გადაცემულ პირობას 

let age = [18, 19, 17, 20, 10, 11, 14, 15]

let result = age.filter((i) => i >= 18)

console.log(result);
