
# 2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

def sum(a, b, c):
    Jami = a + b + c
    return Jami

print(sum(50, 419, 567))



# 3) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" is "მომხმარებლის ასაკი" წლის.


# def user(name, age):
#     return f"მომხმარებლის სახელი: {name}. მომხმარებლის ასაკი: {age}"

# name = input("შეიყვანეთ თქვენი სახელი: ")
# age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# print(user(name.capitalize(), age))



# ეს ფუნქცია ამატებს მხოლოდ დადებით რიცხვებს ლისტიდან უარყოფით რიცხვებს და ნულს კი არა.
def sum_positives(numbers):
    sum = 0
    for i in numbers:
        if i > 0:
            sum = sum + i
    return sum