# ფუნქცია greet – არ იღებს არგუმენტს, უბრალოდ აბრუნებს ტექსტს
def greet():
    return "გამარჯობა! კეთილი იყოს თქვენი მობრძანება!"

# ფუნქციის გამოყენება
message = greet()
print(message)


# ფუნქცია იღებს 2 პარამეტრს (a და b) და აბრუნებს მათ ჯამს
def add(a, b):
    return a + b

# გამოყენება
result = add(5, 7)
print("ჯამი:", result)


# ფუნქცია იღებს 2 პარამეტრს (a და b) და აბრუნებს მათ ნამრავლს
def multiply(a, b):
    return a * b

# გამოყენება
result = multiply(4, 6)
print("ნამრავლი:", result)


# პარამეტრი (parameter) – ცვლადი, რომელსაც ფუნქცია იღებს შექმნის დროს
# მაგალითად: a და b ფუნქციაში add(a, b)

# არგუმენტი (argument) – კონკრეტული მნიშვნელობა, რომელსაც გადავცემთ ფუნქციას
# მაგალითად: add(5, 7) – აქ 5 და 7 არის არგუმენტები

# რატომ ვიყენებთ ფუნქციებს:
# 1) განმეორებადობა – ერთი ფუნქცია რამდენჯერაც გჭირდება, შეგიძლია გამოიყენო
# 2) კოდის ორგანიზება – კოდი იყოფა ნაწილებად
# 3) სირთულის შემცირება – რთული ოპერაციები შეგიძლიათ დაწეროთ ფუნქციაში და შემდგომ მხოლოდ გამოიყენოთ




# ფუნქცია იღებს რიცხვს (პარამეტრი) და აბრუნებს "Even" თუ ლუწია, "Odd" თუ კენტი
def filter(number):
    if number % 2 == 0:
        return "Even"
    else:
        return "Odd"

# გამოყენება
num = int(input("შეიყვანეთ რიცხვი: "))
result = filter(num)
print("შედეგი:", result)
