// 1) მოიძიეთ ინფორმაცია http და https,ასევე გაიგეთ თუ რა არის REST და გააკეთეთ პატარა პრეზენტაზია.

// 2)ახსენით რომელი http ის მოთხოვნები გვაქვს და ახსენით თითოეული



// 3)დაწერე კოდი, რომელიც შეეცდება გამოიძახოს ფუნქცია, რომელიც საერთოდ არ არსებობს (მაგალითად, sayHello()).
// ჩასვი ეს გამოძახება try...catch ბლოკში, რათა პროგრამამ მუშაობა გააგრძელოს.
// შეცდომის დაჭერის შემთხვევაში, კონსოლში გამოიტანე ტექსტი: "სამწუხაროდ, ასეთი ფუნქცია არ არსებობს!".

// 4)ასაკის ვალიდაცია (throw-ს გამოყენება)
// პირობა:
// ხანდახან შეცდომა სისტემური კი არ არის, არამედ ლოგიკური. დაწერე ფუნქცია checkAge(age), რომელიც პარამეტრად მიიღებს ასაკს:
// თუ ასაკი ნაკლებია 18-ზე, ფუნქციამ უნდა "გაისროლოს" (throw) შეცდომა ტექსტით: "წვდომა აკრძალულია: მომხმარებელი არასრულწლოვანია!".
// თუ ასაკი 18 ან მეტია, კონსოლში უბრალოდ გამოიტანოს: "წვდომა დაშვებულია".
// გამოსცადე ეს ფუნქცია try...catch ბლოკში სხვადასხვა რიცხვებით (მაგალითად, 15 და 25) და catch ბლოკში გამოაჩინე ნასროლი შეცდომის მესიჯი.