# len ფუნქცია - აბრუნებს სიის, სტრინგის ან სხვა კოლექციის ელემენტების რაოდენობას
my_list = [1, 2, 3, 4, 5]
print(len(my_list))  # დააბრუნებს 5, რადგან სიაში 5 ელემენტია




# სია სხვადასხვა ტიპის ელემენტებით
my_list = [10, "hello", 3.14, True, "OldName", None]

# შეცვლა 4-ე ინდექსზე (მეხუთე ელემენტი) თქვენი გვარით
my_list[4] = "ივანაშვილი"

print(my_list)


# საყვარელი მეგობრების სახელები
friends = ["გიორგი", "ნიკოლოზი", "თამარი", "ანა", "მარიამი"]

# შეცვლა
friends[2] = 7  # 2-ე ინდექსი (მესამე ელემენტი) საყვარელი რიცხვი
friends[4] = 7  # 4-ე ინდექსი (მეხუთე ელემენტი) საყვარელი რიცხვი

print(friends)


numbers = list(range(1, 21))  # სია 1-დან 20-მდე

# დაბეჭდვა მხოლოდ ლუწ ინდექსებზე (0,2,4,...)
for i in range(0, len(numbers), 2):  # ლუწ ინდექსი
    print(numbers[i])
