# მომხმარებელს შევაყვანინოთ ორი რიცხვი
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# ვბეჭდავთ მათ ჯამს
print("ჯამი არის:", num1 + num2)


# მომხმარებლის მონაცემების შეყვანა
name = input("შეიყვანეთ სახელი: ")
lastname = input("შეიყვანეთ გვარი: ")
age = input("შეიყვანეთ ასაკი: ")
car = input("შეიყვანეთ საყვარელი მანქანა: ")

# ერთი დიდი წინადადების დაბეჭდვა
print("მომხმარებლის სახელია", name, lastname + ", მისი ასაკია", age, "და მისი საყვარელი მანქანაა", car)


# ორი რიცხვის შეყვანა
a = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))

# ნაშთიანად გაყოფა
print("შედეგი:", a // b)
print("ნაშთი:", a % b)


# მომხმარებლის აზრის შეყვანა
academy = input("რომელი პროგრამირების აკადემია მიგაჩნიათ საუკეთესოად? ")

# პასუხის დაბეჭდვა
print("თქვენი აზრით საუკეთესო აკადემიაა:", academy)
