# 1) კომენტარებით ახსენი დღევანდელ გაკვეთილზე ნასწავლი მონაცემთა ტიპები და მოიყვანე თითოეულზე მაგალითი.
# int — მთელი რიცხვი
age = 18

# float — ათწილადი რიცხვი
height = 1.75

# str — ტექსტური მონაცემი (სტრინგი)
name = "Giorgi"

# bool — ლოგიკური მნიშვნელობა (True ან False)
is_student = True

# 2) შექმენი ცვლადი სახელად age და მნიშვნელობად გადაეცი შენი ასაკი. საბოლოოდ დაპრინტე age  ცვლადში გადაცემულ მნიშვნელობას პლიუს 87-ი
age = 18  # აქ ჩაწერე შენი ასაკი
print(age + 87)

# 3) name="giorgi"
#    print(giorgi) რა ერორია კოდში? მიუწერეთ კომენტარის სახით
name = "giorgi"
print(name)  
# Error: ცვლადი 'giorgi' არ არსებობს, სწორი არის print(name)
