// 1) კომენტარებით ახსენით რა არის ფუნქცია.
// ფუნქცია არის მრავალჯერ გამოყენებადი კოდის ბლოკი

// 2) შექმენი ფუნქცია რომელსაც გადაეცემა ორი პარამეტრი, თქვენი დავალებააა გამოიტანოთ პირველი რიცხვი აკვადრატებული მეორე რიცხვზე.
function square(x, y){
    return x ** y
}

console.log(square(3, 5));

// 3) კომენტარის სახით ახსენით, რა განსხვავებაა ჩვეულებრივ ფუნქციას (Regular Function) და Arrow Function-ს შორის JavaScript-ში.

// Arrow function არის მოკლე ფორმა ფუნქციის დასაწერად და იყენებს =>, ჩვეულებრივი ფუნქცია იწერება function keywordით

