# თითოეულ იტერაციაზე დაბეჭდება
for i in range(100):  # range(100) ქმნის რიცხვების სერიას 0-დან 99-მდე
    print("Goa")


# range(start, stop, step) ფუნქციის გამოყენება
for i in range(1, 101, 5):  # იწყება 1-დან, მთავრდება 100-მდე (100-ის ჩათვლით), თითოეულ იტერაციაზე 5-ს ვამატებთ
    print(i)


# range(1, 10, 3):
# 1 → საწყისი მნიშვნელობა (start)
# 10 → ბოლოს მიღწევად მნიშვნელობა (stop, თუმცა ეს ციკლში ჩართული არაა)
# 3 → step, თითოეულ იტერაციაზე რამდენი უნდა გავიდეს

for i in range(1, 10, 3):  # i მიიღებს მნიშვნელობებს: 1, 4, 7
    print(i)  # თითოეული მნიშვნელობის დაბეჭდვა
