# 1)მიმატება: შექმენი lambda ფუნქცია, რომელიც იღებს ერთ რიცხვს და მას 15-ს უმატებს.
sum = lambda x: x + 15
print(sum(10))
# 2)გამრავლება: შექმენი lambda ფუნქცია, რომელიც იღებს ორ არგუმენტს (x და y) და აბრუნებს მათ ნამრავლს.
multiply = lambda x, y: x * y
print(multiply(15, 10))
# 3)ტექსტის შებრუნება: დაწერე lambda, რომელიც მიღებულ სტრიქონს (string) უკუღმა დაწერს (მაგალითად: "Python" -> "nohtyP").
# მინიშნება: გამოიყენე სლაისინგი.
reversed = lambda s: s[::-1]
print(reversed("Tsotne"))

# 4)სიტყვების სიგრძე: გაქვს სია: ["apple", "banana", "cherry", "kiwi"]. დაასორტირე ის სიტყვების სიგრძის მიხედვით.
words = ["apple", "banana", "cherry", "kiwi"]
sorted = sorted(words, key=len)
print(sorted)

# 5)ბოლო ასო: იგივე სია დაასორტირე სიტყვების ბოლო ასოს მიხედვით.
words = ["apple", "banana", "cherry", "kiwi"]
sortedWords = sorted(words, key=lambda x: x[-1])
print(sortedWords)

# 6)Tuples დალაგება: გაქვს პროდუქტების სია ფასებით: [("Milk", 3), ("Bread", 2), ("Cheese", 5)]. დაასორტირე ეს სია ფასის მიხედვით (ზრდადობით).

# 7)ახსენი რა არის lambda და რაში გვჭირდება და რითი განსხვავდება ჩვეულებრივი ფუნქციისგან

# Lambda არის ერთხაზიანი ფუნქცია და ის გამოიყენება მაშინ როდესაც ფუნქციის მხოლოდ ერთხელ გამოყენება გვინდა

