import { useState } from 'react'
import './App.css'
import MyText from './components/MyText'

function App() {
  const [count, setCount] = useState(0)

  return (
    <div>
      <MyText />

      <button onClick={() => setCount(count + 1)}>+</button>
      <h1>{count}</h1>
      <button onClick={() => setCount(count - 1)}>-</button>
    </div>
  )
}

export default App


// 1) გადახედეთ მოცემულ რესურსებს memo - ს შესახებ

// 2) უყურეთ მოცემულ ვიდეოს 

// 3) შექმენით React - ის პროექტი, უნდა გქონდეთ კომპონენტი სახელად MyText რომელსაც გამოაქვს ტექსტი მაგალითად Hello From React, ამ კომპონენტზე გამოიყენეთ memo, App კომპონენტში შექმენით მდგომარეობა სახელად count - ი, უნდა გქონდეთ ერთი ღილაკი მასზე დაჭერისას უნდა შეიცვალოს რიცხვის (შექმნილი მდგომარეობის) მნიშვნელობა, App კომპონენტში გამოიძახეთ MyText კომპონენტი, ასევე პარაგრაფის დახმარებით გამოიტანეთ რიცხვის მნიშვნელობა რომელიც ყოველ დაკლიკებაზე იცვლება, memo - ს დახმარებით როცა რიცხვი ღილაკზე დაჭერისას იცვლება MyText კომპონენტი თავიდან არ რენდერდება

// 4) შექმენით ერთი input - ი სადაც მომხმარებელი შემოიტანს რაიმე სახელს, შექმენით სახელების სია რომელიც შედგება 50 სახელისგან, უნდა გქონდეთ ერთი ფუნქცია, რომელიც გაფილტრავს სიას მომხმარებლის მიერ შემოტანილი სახელის მიხედვით, გამოიყენეთ useMemo კაუჭი, რომ ფილტრაციის ფუნქცია გაუშვათ მხოლოდ მაშინ როცა მომხმარებლის მიერ შემოტანილი სახელის მნიშვნელობა შეიცვლება, უნდა გქონდეთ მდგომარეობა სახელად search რომლის მნიშვნელობაც განახლდება მომხმარებლის მიერ შემოტანილი მნიშვნელობის მიხედვით, გადაუარეთ სიას map - ის გამოყენებით რადგან თითოეული სახელი გამოიტანოთ ეკრანზე დაულაგებელი list - ის სახით

// const filteredNames = useMemo(() => {
//     console.log("Filtering");
//     return names.filter((name) =>
//       name.toLowerCase().includes(search.toLowerCase())
//     );
// }, [search]);

// 5) კომენტარების სახით ახსენით თუ რა არის memo, useMemo, expensive calculation, caching და რას აკეთებს თითოეული მათგანი