# AND ოპერატორი: ორივე პირობა უნდა იყოს მართალი, რომ შედეგი True დაბრუნდეს
a = 10
b = 5

if a > 0 and b > 0:
    print("ორივე რიცხვი დადებითია")  # გამოიტანს ტექსტს, რადგან ორივე პირობა მართალია

if a > 0 and b < 0:
    print("ეს არ დაიბეჭდება")  # ერთი პირობა არასწორია, ამიტომ შედეგი False

# OR ოპერატორი: საკმარისია ერთი პირობა იყოს მართალი, რომ შედეგი True დაბრუნდეს
x = 3
y = -1

if x > 0 or y > 0:
    print("მინიმუმ ერთი რიცხვი დადებითია")  # გამოიტანს ტექსტს, რადგან x>0


my_name = "Tsotne"

# for ციკლი ყოველი ასოს დაბეჭდვისთვის
for letter in my_name:
    print(letter)


num = 2  # პირველი ლუწი რიცხვი
while num <= 20:
    print(num)
    num += 2  # ყოველი ნაბიჯი დამატება 2


my_list = [10, "Hello", 3.14, True, "Python", 42, False, "AI", 99, "Code"]

# წაშლა მეორე ინდექსზე მდგომი ელემენტი (index=2)
del my_list[2]

# სიის ბოლოს საკუთარი სახელის დამატება
my_list.append("Tsotne")

print(my_list)


numbers = [1,2,3,4,5,6,7,8,9,10]

# პირველ ინდექსზე (index=0) გვარის დამატება
numbers.insert(0, "Ivanashvili")

print(numbers)
