// 2)ახსენით რას აკეთებს npm init ბრძანება და ასევე ახსენით რაში არის საჭირო package.json ფაილი 
// npm init იწყებს Nodejs პროექტის ინიციალიზაციას და ის აინსტალირებს package.json 
// რომელიც არის ჩვენი ვებსაიტის პასპორტი მანდ ინახება ყველაფერი ჩვენი პროექტის შესახებ
// და ამის დახმარებით ვინც ამ პროექტს წამოიღებს ანუ გადმოწერს მხოლოდ npm i გაშვება დასჭირდება რათა ყველა node მოდული დაინსტალირდეს


// 3) ახსენით რა განსხვავებაა CommonJS ის მოდულებსა და ES6 ის მოდულებს შორის, რომელს როდის ვიყენებთ
// ეს ორივე არის მოდულების განსხვავებული სისტემა commonJS არის ძველი და მასში რაიმეს შემოტანა ხდება require-ით  
// ხოლო ექსპორტი module.exports-ით 
// ES6 არის უფრო ახალი და ის გამოიყენებს import-ს დასაიმპორტებლად და export-ს დასაექსპორტებლად


import superhero from '@fakerjs/superhero';
console.log(superhero());

