// 1) კომენტარებით ახსენით რა არის for ციკლიი.
// for ციკლი არის მოქმედების გამეორება იმდენჯერ რამდენჯერაც საჭიროა

// 2) რა განსვავებააა for in-სა და for of-ს შორის.
// for in-ის საშუალებით ჩვენ შეგვიძლია გადავუაროთ ნებისმიერ კოლექციას და შედეგად მისი ინდექსი მივიღოთ ხოლო for of-ის საშუალებით თვითონ ელემენტები

// 3) შემქენი for ციკლი სადაც გამოიტანთ 0 დან 20-მდე ლუწ რიცხვებს.

for (let i = 0; i < 20; i+=2){
    console.log(i);
    
}

// 4) შექმენი ცვლადი სადაც შეინახავთ თქვენ სახელს და for in ის საშუალებით გამოიტანეთ თქვენი ცვლადის მნიშვნელობის ინდექსებიი.
let name = "Tsotne"

for(let i in name){
    console.log(i);
    
}


// 5) შექმენი სია სადაც გექნება ნებისმიერი მონაცემთა ტიპის მნიშვნელობა for of ის საშუელებით გამოიტანე მხოლოდ პირველი მნიშვნელობა.

let mix = ["Tsotne", 17, 15.1];

for(let i of mix){
    console.log(i);
    break;
}

// 6) კომენტარის საშუელბით ახსენით რა გასნსვავებაა for ციკლსა და while ციკლს შორის.

// for ციკლს გამოვიყენებთ მხოლოდ იმ შემთხვევაში თუ ვიცით რამდენჯერ უნდა გავამეოროთ იტერაცია ხოლო while ციკლს ვიყენებთ იმ შემთხვევაში როდესაც არ ვიცით

// 7) შექმენი while ციკლი სადაც გამოიტან 1 დან 30-მდე კენტი რიცხვები, ზუსტად იგივე შედეგი გამოიტანე do while-ის საშუალებით.

let ii = 1;

while(ii <= 30){
    console.log(ii);
    ii+=2
    
}


