# არამკაცრი ოპერატორები:
# ==  ტოლია (ადარებს მნიშვნელობებს)
# !=  არ არის ტოლი
# <   ნაკლებია
# >   მეტია
# <=  ნაკლებია ან ტოლია
# >=  მეტია ან ტოლია

# მკაცრი ოპერატორი:
# === Python-ში არ არსებობს
# Python-ში შედარება ხდება მხოლოდ მნიშვნელობებით (==),
# ხოლო ტიპის და მნიშვნელობის ერთდროული შედარება არ გამოიყენება როგორც JS-ში




my_password = "abc123"  # ჩემი მოფიქრებული პაროლი
user_password = input("შეიყვანეთ პაროლი: ")

print(my_password == user_password)  # True თუ ემთხვევა, False თუ არა




age = 18  # ჩემი ასაკი
print(age < 10)




print(5 == 5)
print(10 > 3)
print(7 != 2)
print(4 <= 4)
print(20 >= 10)




print(5 == 3)
print(10 < 2)
print(7 == 9)
print(4 > 10)
print(20 <= 5)
